Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1150/startup_MIMXRT1151.s
ISR_RESERVED                                      // Reserved186_IRQHandler             - Reserved interrupt
ISR_HANDLER2 TMR1                                 // TMR1_IRQHandler                    - TMR1 interrupt
ISR_HANDLER2 TMR2                                 // TMR2_IRQHandler                    - TMR2 interrupt
ISR_HANDLER2 TMR3                                 // TMR3_IRQHandler                    - TMR3 interrupt
ISR_HANDLER2 TMR4                                 // TMR4_IRQHandler                    - TMR4 interrupt
ISR_RESERVED                                      // Reserved191_IRQHandler             - Reserved interrupt
ISR_RESERVED                                      // Reserved192_IRQHandler             - Reserved interrupt
ISR_HANDLER2 PWM2_0                               // PWM2_0_IRQHandler                  - PWM2 capture 0, compare 0, or reload 0 interrupt
ISR_HANDLER2 PWM2_1                               // PWM2_1_IRQHandler                  - PWM2 capture 1, compare 1, or reload 0 interrupt
ISR_HANDLER2 PWM2_2                               // PWM2_2_IRQHandler                  - PWM2 capture 2, compare 2, or reload 0 interrupt
ISR_HANDLER2 PWM2_3                               // PWM2_3_IRQHandler                  - PWM2 capture 3, compare 3, or reload 0 interrupt
ISR_HANDLER2 PWM2_FAULT                           // PWM2_FAULT_IRQHandler              - PWM2 fault or reload error interrupt
ISR_HANDLER2 PWM3_0                               // PWM3_0_IRQHandler                  - PWM3 capture 0, compare 0, or reload 0 interrupt
ISR_HANDLER2 PWM3_1                               // PWM3_1_IRQHandler                  - PWM3 capture 1, compare 1, or reload 0 interrupt
ISR_HANDLER2 PWM3_2                               // PWM3_2_IRQHandler                  - PWM3 capture 2, compare 2, or reload 0 interrupt
ISR_HANDLER2 PWM3_3                               // PWM3_3_IRQHandler                  - PWM3 capture 3, compare 3, or reload 0 interrupt
ISR_HANDLER2 PWM3_FAULT                           // PWM3_FAULT_IRQHandler              - PWM3 fault or reload error interrupt
ISR_HANDLER2 PWM4_0                               // PWM4_0_IRQHandler                  - PWM4 capture 0, compare 0, or reload 0 interrupt
ISR_HANDLER2 PWM4_1                               // PWM4_1_IRQHandler                  - PWM4 capture 1, compare 1, or reload 0 interrupt
ISR_HANDLER2 PWM4_2                               // PWM4_2_IRQHandler                  - PWM4 capture 2, compare 2, or reload 0 interrupt
ISR_HANDLER2 PWM4_3                               // PWM4_3_IRQHandler                  - PWM4 capture 3, compare 3, or reload 0 interrupt
ISR_HANDLER2 PWM4_FAULT                           // PWM4_FAULT_IRQHandler              - PWM4 fault or reload error interrupt
ISR_RESERVED                                      // Reserved208_IRQHandler             - Reserved interrupt
ISR_RESERVED                                      // Reserved209_IRQHandler             - Reserved interrupt
ISR_RESERVED                                      // Reserved210_IRQHandler             - Reserved interrupt
ISR_RESERVED                                      // Reserved211_IRQHandler             - Reserved interrupt
ISR_RESERVED                                      // Reserved212_IRQHandler             - Reserved interrupt
ISR_RESERVED                                      // Reserved213_IRQHandler             - Reserved interrupt
ISR_RESERVED                                      // Reserved214_IRQHandler             - Reserved interrupt
ISR_RESERVED                                      // Reserved215_IRQHandler             - Reserved interrupt
ISR_HANDLER2 PDM_HWVAD_EVENT                      // PDM_HWVAD_EVENT_IRQHandler         - HWVAD event interrupt
ISR_HANDLER2 PDM_HWVAD_ERROR                      // PDM_HWVAD_ERROR_IRQHandler         - HWVAD error interrupt
ISR_HANDLER2 PDM_EVENT                            // PDM_EVENT_IRQHandler               - PDM event interrupt
ISR_HANDLER2 PDM_ERROR                            // PDM_ERROR_IRQHandler               - PDM error interrupt
ISR_RESERVED                                      // Reserved220_IRQHandler             - Reserved interrupt
ISR_RESERVED                                      // Reserved221_IRQHandler             - Reserved interrupt
ISR_HANDLER2 MECC1_INT                            // MECC1_INT_IRQHandler               - MECC1 int
ISR_HANDLER2 MECC1_FATAL_INT                      // MECC1_FATAL_INT_IRQHandler         - MECC1 fatal int
ISR_HANDLER2 MECC2_INT                            // MECC2_INT_IRQHandler               - MECC2 int
ISR_HANDLER2 MECC2_FATAL_INT                      // MECC2_FATAL_INT_IRQHandler         - MECC2 fatal int
ISR_HANDLER2 XECC_FLEXSPI1_INT                    // XECC_FLEXSPI1_INT_IRQHandler       - XECC int
ISR_HANDLER2 XECC_FLEXSPI1_FATAL_INT              // XECC_FLEXSPI1_FATAL_INT_IRQHandler - XECC fatal int
ISR_HANDLER2 XECC_FLEXSPI2_INT                    // XECC_FLEXSPI2_INT_IRQHandler       - XECC int
ISR_HANDLER2 XECC_FLEXSPI2_FATAL_INT              // XECC_FLEXSPI2_FATAL_INT_IRQHandler - XECC fatal int
ISR_HANDLER2 XECC_SEMC_INT                        // XECC_SEMC_INT_IRQHandler           - XECC int
ISR_HANDLER2 XECC_SEMC_FATAL_INT                  // XECC_SEMC_FATAL_INT_IRQHandler     - XECC fatal int
ISR_HANDLER2 ENET_QOS                             // ENET_QOS_IRQHandler                - ENET_QOS interrupt
ISR_HANDLER2 ENET_QOS_PMT                         // ENET_QOS_PMT_IRQHandler            - ENET_QOS_PMT interrupt
ISR_RESERVED                                      // DefaultISR                         - 234
ISR_RESERVED                                      // DefaultISR                         - 235
ISR_RESERVED                                      // DefaultISR                         - 236
ISR_RESERVED                                      // DefaultISR                         - 237
ISR_RESERVED                                      // DefaultISR                         - 238
ISR_RESERVED                                      // DefaultISR                         - 239
ISR_RESERVED                                      // DefaultISR                         - 240
ISR_RESERVED                                      // DefaultISR                         - 241
ISR_RESERVED                                      // DefaultISR                         - 242
ISR_RESERVED                                      // DefaultISR                         - 243
ISR_RESERVED                                      // DefaultISR                         - 244
ISR_RESERVED                                      // DefaultISR                         - 245
ISR_RESERVED                                      // DefaultISR                         - 246
ISR_RESERVED                                      // DefaultISR                         - 247
ISR_RESERVED                                      // DefaultISR                         - 248
ISR_RESERVED                                      // DefaultISR                         - 249
ISR_RESERVED                                      // DefaultISR                         - 250
ISR_RESERVED                                      // DefaultISR                         - 251
ISR_RESERVED                                      // DefaultISR                         - 252
ISR_RESERVED                                      // DefaultISR                         - 253
ISR_RESERVED                                      // DefaultISR                         - 254
.long 0xFFFFFFFF                                  // Reserved for user TRIM value

  .section .vectors, "ax"
_vectors_end:

#if defined VECTORS_IN_RAM && defined XIP_EXTERNAL_FLASH
  .section .vectors_ram, "ax"
_vectors_ram:
  .space _vectors_end-_vectors, 0
#endif

